<!-- terraform-plan-aws_general-purpose-pr-7 -->
## 📝 Terraform Plan for `aws/general-purpose` (PR #7)

<details>
<summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecrpublic_repository.public will be created
  + resource "aws_ecrpublic_repository" "public" {
      + arn             = (known after apply)
      + force_destroy   = false
      + id              = (known after apply)
      + region          = "us-east-1"
      + registry_id     = (known after apply)
      + repository_name = "ishiori-k8s-public-ecr"
      + repository_uri  = (known after apply)
      + tags_all        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ current_aws_caller_identity = {
      ~ arn_without_session = "arn:aws:sts::319844025384:assumed-role/CITerraformProvisionsRole/GitHubActions-17188783338" -> "arn:aws:sts::319844025384:assumed-role/CITerraformProvisionsRole/GitHubActions-17188821383"
        # (1 unchanged attribute hidden)
    }
```

</details>

*Workflow run: [`17188821383`](https://github.com/reverseon/ishiori-on-cloud/actions/runs/17188821383)*
